#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function_app.azurerm_storage_blob.featured_institutions will be created
  + resource "azurerm_storage_blob" "featured_institutions" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "featured-institutions.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "../_modules/function_app/featured-institutions.json"
      + storage_account_name   = "iopitnsvcappbestfn01"
      + storage_container_name = "static-content"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function_app.azurerm_storage_blob.featured_services will be created
  + resource "azurerm_storage_blob" "featured_services" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "featured-services.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "../_modules/function_app/featured-services.json"
      + storage_account_name   = "iopitnsvcappbestfn01"
      + storage_container_name = "static-content"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01/slots/staging"
        name                                           = "staging"
      ~ public_network_access_enabled                  = true -> false
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ ip_restriction_default_action           = "Allow" -> "Deny"
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbestfn01"
        name                              = "iopitnsvcappbestfn01"
      ~ public_network_access_enabled     = true -> false
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
      ~ default_action             = "Allow" -> "Deny"
        id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbestfn01"
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
